In [1]:
import sqlite3
import pandas as pd

## Connect

In [57]:
conn = sqlite3.connect("Text_Processing.db")
print ("open")

open

In [2]:
conn = sqlite3.connect("Text_Cleaning.db")
print ("opened")

opened

## Create Table

In [3]:
conn.execute('''
    CREATE TABLE Tweet	(
    	Input_Text varchar (255)
        ); 
''')

In [4]:
conn.execute('''
    CREATE TABLE Tweet_Clear	(
    	Output_Text varchar (255)
        ); 
''')

In [5]:
conn.execute('''
    CREATE TABLE Tweet_CSV	(
    	Tweet varchar (255)
        ); 
''')

In [8]:
conn.execute('''
    CREATE TABLE Tweet_CSV_Clear	(
    	Tweet varchar (255), Tweet_Clear varchar (255)
        ); 
''')

In [21]:
conn.execute('''
    CREATE TABLE Tweet_CSV_Token	(
    	Tweet varchar (255), Token varchar (255)
        ); 
''')

OperationalError: table Tweet_CSV_Token already exists

In [27]:
conn.execute('''
    CREATE TABLE Tweet_CSV_Normal	(
    	Tweet varchar (255), Normalisasi varchar (255)
        ); 
''')

## Select

In [71]:
Tweet = pd.read_sql_query('SELECT * FROM Tweet',conn)
Tweet.tail()

Empty DataFrame
Columns: [Input_Text]
Index: []

In [72]:
Tweet_Clear = pd.read_sql_query('SELECT * FROM Tweet_Clear',conn)
Tweet_Clear.tail()

Empty DataFrame
Columns: [Output_Text]
Index: []

In [73]:
Tweet_CSV = pd.read_sql_query('SELECT * FROM Tweet_CSV',conn)
Tweet_CSV.tail()

                                                   Tweet
39502  USER jangan asal ngomong ndasmu. congor lu yg ...
39503                       USER Kasur mana enak kunyuk'
39504  USER Hati hati bisu :( .g\n\nlagi bosan huft \...
39505  USER USER USER USER Bom yang real mudah terdet...
39506  USER Mana situ ngasih(": itu cuma foto ya kuti...

In [74]:
Tweet_CSV_Clear = pd.read_sql_query('SELECT * FROM Tweet_CSV_Clear',conn)
Tweet_CSV_Clear.tail()

,Tweet,Tweet_Clear
13164,USER jangan asal ngomong ndasmu. congor lu yg ...,jangan asal ngomong ndasmu congor lu yg seka...
13165,USER Kasur mana enak kunyuk',kasur mana enak kunyuk
13166,USER Hati hati bisu :( .g\n\nlagi bosan huft \...,hati hati bisu g bosan huft
13167,USER USER USER USER Bom yang real mudah terdet...,bom yang real mudah terdeteksi bom yan...
13168,"USER Mana situ ngasih("": itu cuma foto ya kuti...",mana situ ngasih itu cuma foto ya kutil onta

In [75]:
Tweet_CSV_Token = pd.read_sql_query('SELECT * FROM Tweet_CSV_Token',conn)
Tweet_CSV_Token.tail()

,Tweet,Token
13164,USER jangan asal ngomong ndasmu. congor lu yg ...,jangan asal ngomong ndasmu congor lu yg seka...
13165,USER Kasur mana enak kunyuk',kasur mana enak kunyuk
13166,USER Hati hati bisu :( .g\n\nlagi bosan huft \...,hati hati bisu g bosan huft
13167,USER USER USER USER Bom yang real mudah terdet...,bom yang real mudah terdeteksi bom yan...
13168,"USER Mana situ ngasih("": itu cuma foto ya kuti...",mana situ ngasih itu cuma foto ya kutil onta

In [76]:
Tweet_CSV_Normal = pd.read_sql_query('SELECT * FROM Tweet_CSV_Normal',conn)
Tweet_CSV_Normal.tail()

,Tweet,Normalisasi
13164,USER jangan asal ngomong ndasmu. congor lu yg ...,jangan asal ngomong ndasmu congor lu yg seka...
13165,USER Kasur mana enak kunyuk',kasur mana enak kunyuk
13166,USER Hati hati bisu :( .g\n\nlagi bosan huft \...,hati hati bisu g bosan huft
13167,USER USER USER USER Bom yang real mudah terdet...,bom yang real mudah terdeteksi bom yan...
13168,"USER Mana situ ngasih("": itu cuma foto ya kuti...",mana situ ngasih itu cuma foto ya kutil onta

## Delete

In [77]:
conn.execute('DELETE FROM Tweet;',)
conn.commit()

In [78]:
conn.execute('DELETE FROM Tweet_Clear;',)
conn.commit()

In [79]:
conn.execute('DELETE FROM Tweet_CSV;',)
conn.commit()

In [80]:
conn.execute('DELETE FROM Tweet_CSV_Clear;',)
conn.commit()

In [82]:
conn.execute('DELETE FROM Tweet_CSV_Token;',)
conn.commit()

In [83]:
conn.execute('DELETE FROM Tweet_CSV_Normal;',)
conn.commit()

## Close

In [84]:
conn.close()